//==============================================================================
/**
 * @file	we_039.s
 * @brief	しっぽをふる			39
 * @author	goto
 * @date	2005.07.13(水)
 *
 * ここに色々な解説等を書いてもよい
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_SIPPOWOHURU
	
// =============================================================================
//
//
//	■しっぽをふる			39
//
//
// =============================================================================
WEST_SIPPOWOHURU:

	LOOP_LABEL		2
	
		SE_L			SEQ_SE_DP_112

		FUNC_CALL		WEST_SP_WE_KAITEN, 3, WE_TOOL_M1, 1, 12
		WAIT_FLAG
		//SE_L			SEQ_SE_DP_112
	
	LOOP
	
	SEQEND
