//==============================================================================
/**
 * @file	we_114.s
 * @brief	くろいきり			114
 * @author	goto
 * @date	2005.07.13(水)
 *
 * ここに色々な解説等を書いてもよい
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_KUROIKIRI
	
// =============================================================================
//
//
//	■くろいきり			114
//
//
// =============================================================================
WEST_KUROIKIRI:
	
	LOAD_PARTICLE_DROP	0,W_114_SPA
	ADD_PARTICLE 	0,W_114_114_KUROKIRI_MIST1, EMTFUNC_DUMMY

	SE_C			SEQ_SE_DP_W114

	WAIT_PARTICLE
	EXIT_PARTICLE	0,
	
	SEQEND
