//==============================================================================
/**
 * @file	wesub_006.s
 * @brief	こんらん
 * @author	goto
 * @date	2005.07.13(水)
 *
 * ここに色々な解説等を書いてもよい
 *
 */
//==============================================================================
	
	.text
	
	.include	"west.h"

	.global		WEST_DispOut
	
// =============================================================================
//
//
//	■みがわり画面外へ
//
//
// =============================================================================
WEST_DispOut:

	FUNC_CALL	WEST_SP_DISP_MOVE, 5, 0, WE_TOOL_M1, 10, 0, 0,
	
	SE_L		SEQ_SE_DP_W104
	WAIT		1
	
	FUNC_CALL	WEST_SP_WE_SSP_POKE_VANISH, 2, WE_TOOL_M1, 0

	WAIT_FLAG
	
	SEQEND
